app/views/home/index.html.erb

<% FoodPicture.all.each do |fp| %>
---
SELECT "food_pictures".* FROM "food_pictures"