app/controllers/food_pictures_controller.rb

  def index
    @food_pictures = FoodPicture.all
---
SELECT "food_pictures".* FROM "food_pictures"

  def create
    @food_picture = FoodPicture.new(food_picture_params)

    respond_to do |format|
      if @food_picture.save
---
INSERT INTO "food_pictures" ("created_at", "day", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 24 Jul 2013 21:23:06 UTC +00:00], ["day", Wed, 24 Jul 2013], ["updated_at", Wed, 24 Jul 2013 21:23:06 UTC +00:00]]

  def update
    respond_to do |format|
      if @food_picture.update(food_picture_params)
---
UPDATE "food_pictures" SET "picture_file_size" = ?, "picture_updated_at" = ?, "picture_file_name" = ?, "updated_at" = ? WHERE "food_pictures"."id" = 4  [["picture_file_size", 1215649], ["picture_updated_at", Fri, 26 Jul 2013 17:11:42 UTC +00:00], ["picture_file_name", "photo_1.JPG"], ["updated_at", Fri, 26 Jul 2013 17:11:47 UTC +00:00]]

    def set_food_picture
      @food_picture = FoodPicture.find(params[:id])
---
SELECT "food_pictures".* FROM "food_pictures" WHERE "food_pictures"."id" = ? LIMIT 1  [["id", "1"]]