app/controllers/home_controller.rb

SELECT "food_pictures".* FROM "food_pictures" ORDER BY "food_pictures"."id" DESC LIMIT 1
---
  def index
    redirect_to food_picture_url(FoodPicture.last)